
* AOC 2023 Day 9

** Initialize 
#+BEGIN_SRC elisp
  (pyvenv-activate "~/projects/project_venv/")
  ; This is needed to make sure python indentation isn't messed up
  (setq org-src-preserve-indentation t)
#+END_SRC

#+RESULTS:
: t

** Load and validate data
*** Sample
|  0 |  3 |  6 |  9 | 12 | 15 |
|  1 |  3 |  6 | 10 | 15 | 21 |
| 10 | 13 | 16 | 21 | 30 | 45 |

** Day 9 star 1
*** Problem statement
*** Solution
#+BEGIN_SRC python :session  :results value
result = []
try:
  def expand_line(line: str) -> list[int]:
    results = [[int(x) for x in line.split(' ') if x != ' ']]
    # Calculate differences
    while len([x for x in results[-1] if x == 0]) != len(results[-1]):
      results.append([int(results[-1][i])-int(results[-1][i-1])
                      for i in range(1,len(results[-1]))])

    results[-1].append(0)
    for i in range(len(results)-1, 0, -1):
      results[i-1].append(results[i-1][-1] + results[i][-1])
        
    return results
  
  def star_1(path: str) -> list[int]:
    results = []
    with open(path) as f:
      for line in f.read().split("\n"):
        if line:
          results.append(expand_line(line))

    return results

  f = "input.txt"
  #result = star_1(f)[0]
  result = sum(x[0][-1] for x in star_1(f))
  #result = len(star_1(f))
except Exception as e:
  print("Error:",e)
  
result
#+END_SRC

#+RESULTS:
: 1696140818

1696140827 - too high

#+RESULTS:
# 
| -1 | -3 | -3 |   6 |  51 | 200 | 589 | 1453 | 3159 | 6239 | 11421 | 19656 | 32139 | 50322 | 75917 | 110887 | 157423 | 217905 | 294845 | 390810 | 508323 | 649740 |
| -2 |  0 |  9 |  45 | 149 | 389 | 864 | 1706 | 3080 | 5182 |  8235 | 12483 | 18183 | 25595 | 34970 |  46536 |  60482 |  76940 |  95965 | 117513 | 141417 |        |
|  2 |  9 | 36 | 104 | 240 | 475 | 842 | 1374 | 2102 | 3053 |  4248 |  5700 |  7412 |  9375 | 11566 |  13946 |  16458 |  19025 |  21548 |  23904 |        |        |
|  7 | 27 | 68 | 136 | 235 | 367 | 532 |  728 |  951 | 1195 |  1452 |  1712 |  1963 |  2191 |  2380 |   2512 |   2567 |   2523 |   2356 |        |        |        |
| 20 | 41 | 68 |  99 | 132 | 165 | 196 |  223 |  244 |  257 |   260 |   251 |   228 |   189 |   132 |     55 |    -44 |   -167 |        |        |        |        |
| 21 | 27 | 31 |  33 |  33 |  31 |  27 |   21 |   13 |    3 |    -9 |   -23 |   -39 |   -57 |   -77 |    -99 |   -123 |        |        |        |        |        |
|  6 |  4 |  2 |   0 |  -2 |  -4 |  -6 |   -8 |  -10 |  -12 |   -14 |   -16 |   -18 |   -20 |   -22 |    -24 |        |        |        |        |        |        |
| -2 | -2 | -2 |  -2 |  -2 |  -2 |  -2 |   -2 |   -2 |   -2 |    -2 |    -2 |    -2 |    -2 |    -2 |        |        |        |        |        |        |        |
|  0 |  0 |  0 |   0 |   0 |   0 |   0 |    0 |    0 |    0 |     0 |     0 |     0 |     0 |       |        |        |        |        |        |        |        |


** Day 9 star 2
*** Problem statement
*** Solution
#+BEGIN_SRC python :session :results output
try:
  def star_2(data: Data) -> int:
      return 0
  
  print(star_2(data))
except Exception as e:
  print("Error:",e)
#+END_SRC

